Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz1064dag169.h
#define _GLCDCLUT72_RED_POSITION                 0x00000010
#define _GLCDCLUT72_RED_MASK                     0x00FF0000
#define _GLCDCLUT72_RED_LENGTH                   0x00000008

#define _GLCDCLUT73_BLUE_POSITION                0x00000000
#define _GLCDCLUT73_BLUE_MASK                    0x000000FF
#define _GLCDCLUT73_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT73_GREEN_POSITION               0x00000008
#define _GLCDCLUT73_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT73_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT73_RED_POSITION                 0x00000010
#define _GLCDCLUT73_RED_MASK                     0x00FF0000
#define _GLCDCLUT73_RED_LENGTH                   0x00000008

#define _GLCDCLUT74_BLUE_POSITION                0x00000000
#define _GLCDCLUT74_BLUE_MASK                    0x000000FF
#define _GLCDCLUT74_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT74_GREEN_POSITION               0x00000008
#define _GLCDCLUT74_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT74_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT74_RED_POSITION                 0x00000010
#define _GLCDCLUT74_RED_MASK                     0x00FF0000
#define _GLCDCLUT74_RED_LENGTH                   0x00000008

#define _GLCDCLUT75_BLUE_POSITION                0x00000000
#define _GLCDCLUT75_BLUE_MASK                    0x000000FF
#define _GLCDCLUT75_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT75_GREEN_POSITION               0x00000008
#define _GLCDCLUT75_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT75_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT75_RED_POSITION                 0x00000010
#define _GLCDCLUT75_RED_MASK                     0x00FF0000
#define _GLCDCLUT75_RED_LENGTH                   0x00000008

#define _GLCDCLUT76_BLUE_POSITION                0x00000000
#define _GLCDCLUT76_BLUE_MASK                    0x000000FF
#define _GLCDCLUT76_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT76_GREEN_POSITION               0x00000008
#define _GLCDCLUT76_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT76_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT76_RED_POSITION                 0x00000010
#define _GLCDCLUT76_RED_MASK                     0x00FF0000
#define _GLCDCLUT76_RED_LENGTH                   0x00000008

#define _GLCDCLUT77_BLUE_POSITION                0x00000000
#define _GLCDCLUT77_BLUE_MASK                    0x000000FF
#define _GLCDCLUT77_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT77_GREEN_POSITION               0x00000008
#define _GLCDCLUT77_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT77_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT77_RED_POSITION                 0x00000010
#define _GLCDCLUT77_RED_MASK                     0x00FF0000
#define _GLCDCLUT77_RED_LENGTH                   0x00000008

#define _GLCDCLUT78_BLUE_POSITION                0x00000000
#define _GLCDCLUT78_BLUE_MASK                    0x000000FF
#define _GLCDCLUT78_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT78_GREEN_POSITION               0x00000008
#define _GLCDCLUT78_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT78_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT78_RED_POSITION                 0x00000010
#define _GLCDCLUT78_RED_MASK                     0x00FF0000
#define _GLCDCLUT78_RED_LENGTH                   0x00000008

#define _GLCDCLUT79_BLUE_POSITION                0x00000000
#define _GLCDCLUT79_BLUE_MASK                    0x000000FF
#define _GLCDCLUT79_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT79_GREEN_POSITION               0x00000008
#define _GLCDCLUT79_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT79_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT79_RED_POSITION                 0x00000010
#define _GLCDCLUT79_RED_MASK                     0x00FF0000
#define _GLCDCLUT79_RED_LENGTH                   0x00000008

#define _GLCDCLUT80_BLUE_POSITION                0x00000000
#define _GLCDCLUT80_BLUE_MASK                    0x000000FF
#define _GLCDCLUT80_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT80_GREEN_POSITION               0x00000008
#define _GLCDCLUT80_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT80_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT80_RED_POSITION                 0x00000010
#define _GLCDCLUT80_RED_MASK                     0x00FF0000
#define _GLCDCLUT80_RED_LENGTH                   0x00000008

#define _GLCDCLUT81_BLUE_POSITION                0x00000000
#define _GLCDCLUT81_BLUE_MASK                    0x000000FF
#define _GLCDCLUT81_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT81_GREEN_POSITION               0x00000008
#define _GLCDCLUT81_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT81_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT81_RED_POSITION                 0x00000010
#define _GLCDCLUT81_RED_MASK                     0x00FF0000
#define _GLCDCLUT81_RED_LENGTH                   0x00000008

#define _GLCDCLUT82_BLUE_POSITION                0x00000000
#define _GLCDCLUT82_BLUE_MASK                    0x000000FF
#define _GLCDCLUT82_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT82_GREEN_POSITION               0x00000008
#define _GLCDCLUT82_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT82_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT82_RED_POSITION                 0x00000010
#define _GLCDCLUT82_RED_MASK                     0x00FF0000
#define _GLCDCLUT82_RED_LENGTH                   0x00000008

#define _GLCDCLUT83_BLUE_POSITION                0x00000000
#define _GLCDCLUT83_BLUE_MASK                    0x000000FF
#define _GLCDCLUT83_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT83_GREEN_POSITION               0x00000008
#define _GLCDCLUT83_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT83_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT83_RED_POSITION                 0x00000010
#define _GLCDCLUT83_RED_MASK                     0x00FF0000
#define _GLCDCLUT83_RED_LENGTH                   0x00000008

#define _GLCDCLUT84_BLUE_POSITION                0x00000000
#define _GLCDCLUT84_BLUE_MASK                    0x000000FF
#define _GLCDCLUT84_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT84_GREEN_POSITION               0x00000008
#define _GLCDCLUT84_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT84_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT84_RED_POSITION                 0x00000010
#define _GLCDCLUT84_RED_MASK                     0x00FF0000
#define _GLCDCLUT84_RED_LENGTH                   0x00000008

#define _GLCDCLUT85_BLUE_POSITION                0x00000000
#define _GLCDCLUT85_BLUE_MASK                    0x000000FF
#define _GLCDCLUT85_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT85_GREEN_POSITION               0x00000008
#define _GLCDCLUT85_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT85_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT85_RED_POSITION                 0x00000010
#define _GLCDCLUT85_RED_MASK                     0x00FF0000
#define _GLCDCLUT85_RED_LENGTH                   0x00000008

